##  Grouping and Aggregation

In [2]:
import pandas as pd
import numpy as np

data = { 
'Region': ['North', 'South', 'North', 'South', 'East', 'West', 'East', 'West', 'North', 'South'], 
'Product': ['A', 'A', 'B', 'B', 'A', 'B', 'C', 'C', 'A', 'C'], 
'Sales': [100, 150, 200, 250, 120, 220, 180, 280, 110, 170], 
'Quantity': [10, 15, 20, 25, 12, 22, 18, 28, 11, 17] 
} 
df_sales = pd.DataFrame(data)
df_sales

  Region Product  Sales  Quantity
0  North       A    100        10
1  South       A    150        15
2  North       B    200        20
3  South       B    250        25
4   East       A    120        12
5   West       B    220        22
6   East       C    180        18
7   West       C    280        28
8  North       A    110        11
9  South       C    170        17

In [3]:
emp_data = { 
'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'Finance', 'IT', 'HR'], 
'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Heidi'], 
'Salary': [70000, 80000, 90000, 85000, 72000, 95000, 88000, 75000], 
'Experience': [5, 8, 10, 7, 6, 12, 9, 7] 
} 
df_emp = pd.DataFrame(emp_data)
df_emp

  Department Employee  Salary  Experience
0         HR    Alice   70000           5
1         IT      Bob   80000           8
2    Finance  Charlie   90000          10
3         IT    David   85000           7
4         HR      Eve   72000           6
5    Finance    Frank   95000          12
6         IT    Grace   88000           9
7         HR    Heidi   75000           7

In [4]:
# 1. From df_sales, calculate the total sales for each region. 
df_sales.groupby('Region')['Sales'].sum()

Region
East     300
North    410
South    570
West     500
Name: Sales, dtype: int64

In [6]:
#2. Find the average sales and total quantity sold for each product in df_sales. 
df_sales.groupby('Product').agg({'Sales':'mean','Quantity':'sum'})

              Sales  Quantity
Product
A        120.000000        48
B        223.333333        67
C        210.000000        63

In [7]:
# 3. From df_emp, find the average salary and maximum experience for each department. 
df_emp.groupby('Department').agg({'Salary':'mean','Experience':'max'})

                  Salary  Experience
Department
Finance     92500.000000          12
HR          72333.333333           7
IT          84333.333333           9

In [8]:
# 4. Group df_sales by both 'Region' and 'Product' and find the sum of sales. 
df_sales.groupby(['Region','Product'])['Sales'].sum()

Region  Product
East    A          120
        C          180
North   A          210
        B          200
South   A          150
        B          250
        C          170
West    B          220
        C          280
Name: Sales, dtype: int64

In [9]:
# 5. Count the number of employees in each department using df_emp. 
df_emp['Department'].value_counts()

Department
HR         3
IT         3
Finance    2
Name: count, dtype: int64

In [10]:
# 6. For each department in df_emp, find the employee with the highest salary. (Hint: Use .idxmax()).
df_emp.loc[df_emp.groupby('Department')['Salary'].idxmax()]

  Department Employee  Salary  Experience
5    Finance    Frank   95000          12
7         HR    Heidi   75000           7
6         IT    Grace   88000           9

In [11]:
# 7. Calculate the range of salaries (max - min) for each department in df_emp. 
df_emp.groupby('Department')['Salary'].apply(lambda x: x.max()-x.min())

Department
Finance    5000
HR         5000
IT         8000
Name: Salary, dtype: int64

In [14]:
# 8. From df_sales, find the regions where the total sales are greater than 400. 
df_sales.groupby('Region')['Sales'].sum().loc[lambda x: x>400]

Region
North    410
South    570
West     500
Name: Sales, dtype: int64

In [15]:
# 9. Get the size of each group when grouping df_sales by 'Region'. 
df_sales.groupby('Region').size()

Region
East     2
North    3
South    3
West     2
dtype: int64

In [18]:
# 10. For each product in df_sales, calculate the average sale price per unit (Sales / Quantity). 
df_sales.groupby('Product').apply(lambda x: x['Sales'].sum()/x['Quantity'].sum())

C:\Users\babur\AppData\Local\Temp\ipykernel_19956\2755904964.py:2: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df_sales.groupby('Product').apply(lambda x: x['Sales'].sum()/x['Quantity'].sum())

Product
A    10.0
B    10.0
C    10.0
dtype: float64

In [19]:
# 11. From df_emp, create a new column 'Salary_Rank' that ranks employees by salary within each department.
df_emp['Salary_Rank'] = df_emp.groupby('Department')['Salary'].rank(ascending=False)
df_emp[['Department','Employee','Salary','Salary_Rank']]

  Department Employee  Salary  Salary_Rank
0         HR    Alice   70000          3.0
1         IT      Bob   80000          3.0
2    Finance  Charlie   90000          2.0
3         IT    David   85000          2.0
4         HR      Eve   72000          2.0
5    Finance    Frank   95000          1.0
6         IT    Grace   88000          1.0
7         HR    Heidi   75000          1.0

In [20]:
# 12. Normalize the 'Salary' column in df_emp by subtracting the department's average salary from each employee's salary (i.e., calculate the Z-score for salary within each department). 
df_emp['Salary_Normalized'] = df_emp.groupby('Department')['Salary'].transform(lambda x: x - x.mean())
df_emp[['Department','Employee','Salary','Salary_Normalized']]

  Department Employee  Salary  Salary_Normalized
0         HR    Alice   70000       -2333.333333
1         IT      Bob   80000       -4333.333333
2    Finance  Charlie   90000       -2500.000000
3         IT    David   85000         666.666667
4         HR      Eve   72000        -333.333333
5    Finance    Frank   95000        2500.000000
6         IT    Grace   88000        3666.666667
7         HR    Heidi   75000        2666.666667